balance/src/InformationRegisters/НастройкиПодключенияКВнешнемуИсточникуДанных/НастройкиПодключенияКВнешнемуИсточникуДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПодключенияКВнешнемуИсточникуДанных</name>
  <dimensions>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИмяВнешнейБД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>АутентификацияОС</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

balance/src/CommonModules/СервисныеМеханизмы/Module.bsl
Процедура УдалитьВременныеНастройки(КлючВременныхНастроек = "#УдалитьПриЗавершенииРаботы#") Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Выборка = ХранилищеСистемныхНастроек.Выбрать();
	Пока Выборка.Следующий() Цикл
	    Если СтрНайти(Выборка.КлючОбъекта, КлючВременныхНастроек) > 0 Тогда
	          ХранилищеСистемныхНастроек.Удалить(Выборка.КлючОбъекта, Выборка.КлючНастроек, Выборка.Пользователь);
	    КонецЕсли;      
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры // УдалитьВременныеНастройки()

Функция НужнаНастройкаПриПервомЗапуске() Экспорт
	ЗапросСправочников = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                                  |	Подразделения.Ссылка КАК Ссылка
	                                  |ИЗ
	                                  |	Справочник.Подразделения КАК Подразделения
	                                  |
	                                  |УПОРЯДОЧИТЬ ПО
	                                  |	Ссылка");
	Список=ЗапросСправочников.Выполнить().Выбрать();
	Если Список.Следующий() тогда
		Возврат Ложь;
	КонецЕсли;
	Возврат Истина;
КонецФункции

Функция ПолучитьПараметрыПодключенияКВнешнейИБ() Экспорт; 
	Запрос = Новый Запрос; Запрос.Текст = "ВЫБРАТЬ 
	| НастройкиПодключения.Сервер, 
	| НастройкиПодключения.Логин, 
	| НастройкиПодключения.Пароль, 
	| НастройкиПодключения.ИмяВнешнейБД, 
	| НастройкиПодключения.АутентификацияОС 
	|ИЗ 
	| РегистрСведений.НастройкиПодключенияКВнешнемуИсточникуДанных КАК НастройкиПодключения";
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() 
		Тогда Сообщить("Не указаны настройки для подключения к внешнему источнику данных"); 
		Возврат Неопределено;
	КонецЕсли; 
	Выборка = Результат.Выбрать(); 
	Выборка.Следующий(); 
	ПараметрыПодключения = Новый Структура; 
	Если Выборка.АутентификацияОС Тогда ПараметрыПодключения.Вставить("СтрокаСоединения", "DRIVER={SQL Server};SERVER="+Выборка.Сервер+";Trusted_Connection=yes;DATABASE="+Выборка.ИмяВнешнейБД+";LANGUAGE=русский"); 
		ПараметрыПодключения.Вставить("Логин", ""); ПараметрыПодключения.Вставить("Пароль", "");
	Иначе ПараметрыПодключения.Вставить("СтрокаСоединения", "DRIVER={SQL Server};SERVER="+Выборка.Сервер+";"+"UID="+Выборка.Логин+";PWD="+Выборка.Пароль+";DATABASE="+Выборка.ИмяВнешнейБД+";LANGUAGE=русский");
		ПараметрыПодключения.Вставить("Логин", Выборка.Логин); ПараметрыПодключения.Вставить("Пароль", Выборка.Пароль);
	КонецЕсли; 
	ПараметрыПодключения.Вставить("АутентификацияОС", Выборка.АутентификацияОС); 
	Возврат ПараметрыПодключения; 
КонецФункции

Процедура ПодключитьсяКВнешнемуИсточникуДанныхMSSqlServer(СтрокаСоединения, Логин, Пароль, АутентификацияОС) Экспорт 
	ПараметрыСоединения = ВнешниеИсточникиДанных.BalanceDB.ПолучитьОбщиеПараметрыСоединения(); 
	ПараметрыСоединения.АутентификацияСтандартная = Не АутентификацияОС;
	ПараметрыСоединения.АутентификацияОС = АутентификацияОС;
	ПараметрыСоединения.ИмяПользователя = Логин;
	ПараметрыСоединения.Пароль = Пароль;
	ПараметрыСоединения.СтрокаСоединения = СтрокаСоединения; 
	ПараметрыСоединения.СУБД = "MSSQLServer";
	Попытка ВнешниеИсточникиДанных.BalanceDB.УстановитьОбщиеПараметрыСоединения(ПараметрыСоединения);
		ВнешниеИсточникиДанных.BalanceDB.УстановитьПараметрыСоединенияПользователя(ИмяПользователя(),ПараметрыСоединения);
		ВнешниеИсточникиДанных.BalanceDB.УстановитьПараметрыСоединенияСеанса(ПараметрыСоединения);
		ВнешниеИсточникиДанных.BalanceDB.УстановитьСоединение(); 
		Сообщить("Подключение к внешнему источнику данных выполнено успешно"); 
	Исключение Сообщить("Не удалось подключиться к внешнему источнику данных"); 
	КонецПопытки 
КонецПроцедуры
